admbase/src/Documents/УстановкаРасчетЦенНоменклатуры/УстановкаРасчетЦенНоменклатуры.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>УстановкаРасчетЦенНоменклатуры</name>
  <registerRecords>InformationRegister.ЦеныНоменклатуры</registerRecords>
  <attributes>
    <name>ПериодРегистрации</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ЦеныПродуктов</name>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Цена</name>
      <comment>Цена устанавливаемая за 1 блюдо</comment>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ЦенаЗакупки</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ЦеныБлюд</name>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Цена</name>
      <comment>Цена устанавливаемая за 1 блюдо</comment>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ЦенаРасчетная</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ЦеныМеню</name>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Цена</name>
      <comment>Цена устанавливаемая за 1 блюдо</comment>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ЦенаРасчетная</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>РасчетСотрудники</name>
    <attributes>
      <name>Сотрудник</name>
      <type>
        <types>CatalogRef.Сотрудники</types>
      </type>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СуммаРасчетная</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

admbase/src/InformationRegisters/ЦеныНоменклатуры/ЦеныНоменклатуры.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ЦеныНоменклатуры</name>
  <informationRegisterPeriodicity>Month</informationRegisterPeriodicity>
  <writeMode>RecorderSubordinate</writeMode>
  <resources>
    <name>Цена</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ЦенаРасчет</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Номенклатура</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

admbase/src/Catalogs/Номенклатура/Номенклатура.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>Номенклатура</name>
  <hierarchical>true</hierarchical>
  <attributes>
    <name>ВидНоменклатуры</name>
    <type>
      <types>CatalogRef.ВидыНоменклатуры</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидСтола</name>
    <type>
      <types>EnumRef.ВидыСтолов</types>
    </type>
  </attributes>
  <attributes>
    <name>ЕдиницаДляРецептов</name>
    <type>
      <types>CatalogRef.ЕдиницыИзмерения</types>
    </type>
  </attributes>
  <attributes>
    <name>ЕдиницаИзмерения</name>
    <type>
      <types>CatalogRef.ЕдиницыИзмерения</types>
    </type>
  </attributes>
  <attributes>
    <name>КатегорияМеню</name>
    <type>
      <types>CatalogRef.КатегорииМеню</types>
    </type>
  </attributes>
  <attributes>
    <name>КоличествоБлюд</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>4</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НаименованиеПолное</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>250</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДляМеню</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ДляРецептов</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>СодержитЕдиницХранения</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Состояние</name>
    <type>
      <types>EnumRef.СостояниеБлюда</types>
    </type>
  </attributes>
  <tabularSections>
    <name>СоставНабора</name>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ЕдиницаИзмерения</name>
      <type>
        <types>CatalogRef.ЕдиницыИзмерения</types>
      </type>
    </attributes>
    <attributes>
      <name>кКал</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

admbase/src/Documents/УстановкаРасчетЦенНоменклатуры/ObjectModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
	
#Область ОбработчикиСобытий

Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Ссылка",Ссылка);
	Запрос.УстановитьПараметр("Период",ПериодРегистрации);
	
#Область ТекстЗапроса
	
	Запрос.Текст = "ВЫБРАТЬ
	               |	УстановкаРасчетЦенНоменклатурыЦеныПродуктов.Номенклатура КАК Номенклатура,
	               |	УстановкаРасчетЦенНоменклатурыЦеныПродуктов.Цена КАК Цена,
	               |	УстановкаРасчетЦенНоменклатурыЦеныПродуктов.ЦенаЗакупки КАК ЦенаРасчет,
	               |	СправочникНоменклатура.ВидНоменклатуры КАК ВидНоменклатуры,
	               |	УстановкаРасчетЦенНоменклатурыЦеныПродуктов.НомерСтроки КАК НомерСтроки,
	               |	&Период КАК Период
	               |ИЗ
	               |	Документ.УстановкаРасчетЦенНоменклатуры.ЦеныПродуктов КАК УстановкаРасчетЦенНоменклатурыЦеныПродуктов
	               |		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Номенклатура КАК СправочникНоменклатура
	               |		ПО УстановкаРасчетЦенНоменклатурыЦеныПродуктов.Номенклатура = СправочникНоменклатура.Ссылка
	               |ГДЕ
	               |	УстановкаРасчетЦенНоменклатурыЦеныПродуктов.Ссылка = &Ссылка
	               |
	               |ОБЪЕДИНИТЬ ВСЕ
	               |
	               |ВЫБРАТЬ
	               |	УстановкаРасчетЦенНоменклатурыЦеныБлюд.Номенклатура,
	               |	УстановкаРасчетЦенНоменклатурыЦеныБлюд.Цена,
	               |	УстановкаРасчетЦенНоменклатурыЦеныБлюд.ЦенаРасчетная,
	               |	СправочникНоменклатура.ВидНоменклатуры,
	               |	УстановкаРасчетЦенНоменклатурыЦеныБлюд.НомерСтроки,
	               |	&Период
	               |ИЗ
	               |	Документ.УстановкаРасчетЦенНоменклатуры.ЦеныБлюд КАК УстановкаРасчетЦенНоменклатурыЦеныБлюд
	               |		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Номенклатура КАК СправочникНоменклатура
	               |		ПО УстановкаРасчетЦенНоменклатурыЦеныБлюд.Номенклатура = СправочникНоменклатура.Ссылка
	               |ГДЕ
	               |	УстановкаРасчетЦенНоменклатурыЦеныБлюд.Ссылка = &Ссылка
	               |
	               |ОБЪЕДИНИТЬ ВСЕ
	               |
	               |ВЫБРАТЬ
	               |	УстановкаРасчетЦенНоменклатурыЦеныМеню.Номенклатура,
	               |	УстановкаРасчетЦенНоменклатурыЦеныМеню.Цена,
	               |	УстановкаРасчетЦенНоменклатурыЦеныМеню.ЦенаРасчетная,
	               |	СправочникНоменклатура.ВидНоменклатуры,
	               |	УстановкаРасчетЦенНоменклатурыЦеныМеню.НомерСтроки,
	               |	&Период
	               |ИЗ
	               |	Документ.УстановкаРасчетЦенНоменклатуры.ЦеныМеню КАК УстановкаРасчетЦенНоменклатурыЦеныМеню
	               |		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Номенклатура КАК СправочникНоменклатура
	               |		ПО УстановкаРасчетЦенНоменклатурыЦеныМеню.Номенклатура = СправочникНоменклатура.Ссылка
	               |ГДЕ
	               |	УстановкаРасчетЦенНоменклатурыЦеныМеню.Ссылка = &Ссылка
	               |
	               |УПОРЯДОЧИТЬ ПО
	               |	ВидНоменклатуры,
	               |	НомерСтроки";
	
#КонецОбласти

	Результат = Запрос.ВыполнитьПакет();
	
	Движения.ЦеныНоменклатуры.Записывать = Истина;
	
	Выборка = Результат[0].Выбрать();
	Пока Выборка.Следующий() Цикл
		ЗаполнитьЗначенияСвойств(Движения.ЦеныНоменклатуры.Добавить(),Выборка)
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти	

#КонецЕсли
